Tasks/ПодготовкаПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Task>
		<Properties>
			<Name>ПодготовкаПроекта</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторСоздания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КрайняяДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбъектыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Наблюдатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наблюдатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

Enums/ОбъектыЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ОбъектыЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВедущийКонструктор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнитьКартуПроектаДиз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнитьКартуПроектаКон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаполнениеДлительностиПроизводства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаполненияДлительностиМонтажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодготовитьОзнакомительныйВыезд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроверятьГабаритныеЧерчежи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РуководительЗамера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьЗапускВРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьКартуПроектаДиз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьКартуПроектаКон</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ОзнакомительныйВыезд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОзнакомительныйВыезд</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыездаПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыездаФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ПодготовкаПроекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СокращенноеНазвание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГабаритныеЧертежи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГабаритныйЧертеж</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Помещения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Исполнители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗапускВРаботу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗапускВРаботу</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедущийКонструкторДатаПодписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедущийКонструкторПодписьАвтор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДизайнерДатаПодписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДизайнерПодписьАвтор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументЗакрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ПодготовкаПроекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Комплекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комплект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СофтПКД</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Софт</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СофтРКД</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Софт</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Tasks/ПодготовкаПроекта/Forms/ФормаЗадачи/Ext/Form/Module.bsl
&НаКлиенте
Перем мТипыЗадачСкрытоеМеню;

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	мТипыЗадачСкрытоеМеню = Новый Массив;
	мТипыЗадачСкрытоеМеню.Добавить(ПредопределенноеЗначение("Перечисление.ОбъектыЗадач.ПодготовитьОзнакомительныйВыезд"));
	мТипыЗадачСкрытоеМеню.Добавить(ПредопределенноеЗначение("Перечисление.ОбъектыЗадач.СоздатьЗапускВРаботу"));

	Заголовок = Строка(Объект.ТипЗадачи);
	
	Элементы.Основание.Видимость = ЗначениеЗаполнено(Объект.Основание);
	
	ДобавитьДополнительныеРеквизиты(); 
	
	ВидимостьЭлементов();
	
	Если Объект.Выполнена Тогда
	
		ЭтаФорма.ТолькоПросмотр = Истина;	
	
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ВидимостьЭлементов()

	
	Если НЕ мТипыЗадачСкрытоеМеню.Найти(Объект.ТипЗадачи) = Неопределено Тогда
	
		КоманднаяПанель.Видимость =	Ложь;	
	
	КонецЕсли;
	
	Элементы.ДекорацияВыполнена.Видимость 	= Объект.Выполнена;
	Элементы.Назначение.Видимость 			= ЗначениеЗаполнено(Объект.Назначение);
	Элементы.Основание.Видимость 			= ЗначениеЗаполнено(Объект.Основание);

КонецПроцедуры // ВидимостьЭлементов()


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	//АнализПодготовительногоВыезда();
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьДополнительныеРеквизиты()

	Если НЕ мТипыЗадачСкрытоеМеню.Найти(Объект.ТипЗадачи) = Неопределено Тогда
		
		ДобавитьДополнительныеРеквизитыНаСервере();			
		
	КонецЕсли;	
	
КонецПроцедуры // ДобавитьДополнительныеРеквизиты() ОбщегоНазначения.ЕстьРеквизитОбъекта("СоздатьОзнакомительныйВыезд", Объект.метаданные) 

Процедура ДобавитьДополнительныеРеквизитыНаСервере()

	Если Объект.ТипЗадачи = ПредопределенноеЗначение("Перечисление.ОбъектыЗадач.ПодготовитьОзнакомительныйВыезд") Тогда
		
		Если НЕ ЕстьОзнакомительныйВыезд(Объект.Ссылка) Тогда
			СоздатьКнопку("СоздатьОзнакомительныйВыезд", "Создать ознакомительный выезд");	
		КонецЕсли;
	ИначеЕсли Объект.ТипЗадачи = ПредопределенноеЗначение("Перечисление.ОбъектыЗадач.СоздатьЗапускВРаботу") Тогда
		
		Если НЕ ЕстьЗапускВРаботу(Объект.Ссылка) Тогда
			СоздатьКнопку("СоздатьЗапускВРаботу", "Создать запуск в работу");	
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры // ДобавитьДополнительныеРеквизиты()

Процедура СоздатьКнопку(Действие, Заголовок)
	
	НоваяКоманда = ЭтаФорма.Команды.Добавить(Действие);
	НоваяКоманда.Действие 	= "НажатиеКнопки";
	НоваяКоманда.Заголовок 	= Заголовок;
	
	ИмяКнопки 										= Действие;
	КнопкаСоздатьОзнакомительныйВыезд 				= Элементы.Добавить(ИмяКнопки, Тип("КнопкаФормы"), Элементы.ГруппаКоманднаяПанель);
	КнопкаСоздатьОзнакомительныйВыезд.Вид 			= ВидКнопкиФормы.ОбычнаяКнопка;
	КнопкаСоздатьОзнакомительныйВыезд.ИмяКоманды 	= Действие;
	
КонецПроцедуры

&НаКлиенте
Процедура НажатиеКнопки(Команда)
	
	Если Команда.Имя = "СоздатьОзнакомительныйВыезд" Тогда
		
		Форма = ПолучитьФорму("Документ.ОзнакомительныйВыезд.ФормаОбъекта");
		
		ДанныеФормы = Форма.Объект;
		
		стПараметры = Новый Структура("Проект, Основание, ТипДокумента", );
		стПараметры.Проект 		= Объект.Проект;
		стПараметры.Основание 	= Объект.Ссылка;
		
		ЗаполнитьДокументНаСервере(ДанныеФормы, стПараметры);
		КопироватьДанныеФормы(ДанныеФормы, Форма.Объект); 	
		
	ИначеЕсли Команда.Имя = "СоздатьЗапускВРаботу" Тогда
		
		Форма = ПолучитьФорму("Документ.ЗапускВРаботу.ФормаОбъекта");
		
		ДанныеФормы = Форма.Объект;
		
		стПараметры = Новый Структура("Проект, Основание, ТипДокумента", );
		стПараметры.Проект 			= Объект.Проект;
		стПараметры.Основание 		= Объект.Ссылка;
		стПараметры.ТипДокумента 	= "ЗапускВРаботу";
		
		ЗаполнитьДокументНаСервере(ДанныеФормы, стПараметры);
		КопироватьДанныеФормы(ДанныеФормы, Форма.Объект); 	
		
		
	КонецЕсли;
	
	Форма.Открыть();
	
КонецПроцедуры // СоздатьОзнакомительныйВыезд()


&НаСервереБезКонтекста
Функция ЗаполнитьДокументНаСервере(ДанныеФормы, стПараметры);
	
	Док = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДокументОбъект." + стПараметры.ТипДокумента)); 
	
	Док = Документы[стПараметры.ТипДокумента].СоздатьДокумент();
	Док.Дата = ТекущаяДата();
	ЗаполнитьЗначенияСвойств(Док, стПараметры);
	
	ЗначениеВДанныеФормы(Док, ДанныеФормы); 
	
КонецФункции


Функция ЕстьОзнакомительныйВыезд(СсылкаНаЗадачу)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОзнакомительныйВыезд.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ОзнакомительныйВыезд КАК ОзнакомительныйВыезд
		|ГДЕ
		|	ОзнакомительныйВыезд.Основание = &Основание";
	
	Запрос.УстановитьПараметр("Основание", СсылкаНаЗадачу);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
    Если Выборка.Количество() = 0 Тогда
		Возврат Ложь;	
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // ЕстьОзнакомительныйВыезд()


Функция ЕстьЗапускВРаботу(СсылкаНаЗадачу)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗапускВРаботу.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗапускВРаботу КАК ЗапускВРаботу
		|ГДЕ
		|	ЗапускВРаботу.Основание = &Основание";
	
	Запрос.УстановитьПараметр("Основание", СсылкаНаЗадачу);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
    Если Выборка.Количество() = 0 Тогда
		Возврат Ложь;	
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // ЕстьЗапускВРаботу()

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеЗамеров" Тогда
		
		Если Тип("ДокументСсылка.ОзнакомительныйВыезд") = ТипЗнч(Параметр) Тогда
			
			ИмяКнопки = "СоздатьОзнакомительныйВыезд";
			
		ИначеЕсли Тип("ДокументСсылка.ЗапускВРаботу") = ТипЗнч(Параметр) Тогда
			
			ИмяКнопки = "СоздатьЗапускВРаботу";
			
		Иначе
			
			Возврат;
			
		КонецЕсли;
			Если НЕ Элементы.Найти(ИмяКнопки) = Неопределено Тогда
				
				Элементы[ИмяКнопки].Видимость 			= Ложь;	
				Элементы.ДекорацияВыполнена.Видимость 	= Истина;
				
			КонецЕсли;
			
		
	КонецЕсли;
	
КонецПроцедуры
